#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`

Show Plan

```terraform
[0m[1mmodule.cloudflare_setup.data.cloudflare_zone.lilja_dot_io: Reading...[0m[0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.cname_dkim3: Refreshing state... [id=fbb831323bced8e857c178d8df4ebadb][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_mailsec: Refreshing state... [id=92ed20e9c1228ea46c74ea80d1505566][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.cname_dkim2: Refreshing state... [id=fccded21c489eb0af1be2b60b8146d9c][0m
[0m[1mmodule.cloudflare_setup.data.cloudflare_zone.lilja_dot_io: Read complete after 0s [id=801ec7bc35b2abc9580d847c7b5c6f56][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.txt_dmarc: Refreshing state... [id=a8e709d83e8eb264c9efb249b6b7840a][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_protomain_verification: Refreshing state... [id=5a64b437361c0d87c612affbabf5a1b5][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_mail: Refreshing state... [id=6a0c264f84eebecec606e8d26c26a424][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.cname_dkim1: Refreshing state... [id=9677ec4eac251f1da60d2a6b945d7d48][0m
[0m[1mmodule.cloudflare_setup.cloudflare_record.mx_proton_spf1: Refreshing state... [id=63d176ec8068198506fb92d83af88bee][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # module.cloudflare_setup.cloudflare_record.cname_dkim1[0m will be [1m[31mdestroyed[0m
  # (because resource uses count or for_each)
[0m  [31m-[0m[0m resource "cloudflare_record" "cname_dkim1" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2023-05-28T21:40:50.683325Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "protonmail._domainkey.lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "9677ec4eac251f1da60d2a6b945d7d48" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2023-05-28T21:40:50.683325Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "protonmail._domainkey" [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = true [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "CNAME" [90m-> null[0m[0m
      [31m-[0m[0m value           = (sensitive value) [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"][0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "cname_dkim1" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m content         = "protonmail.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "protonmail._domainkey"
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = (known after apply)
      [32m+[0m[0m type            = "CNAME"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"][0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "cname_dkim1" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m content         = "protonmail2.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "protonmail2._domainkey"
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = (known after apply)
      [32m+[0m[0m type            = "CNAME"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"][0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "cname_dkim1" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m content         = "protonmail3.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "protonmail3._domainkey"
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = (known after apply)
      [32m+[0m[0m type            = "CNAME"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_setup.cloudflare_record.cname_dkim2[0m will be [1m[31mdestroyed[0m
  # (because cloudflare_record.cname_dkim2 is not in configuration)
[0m  [31m-[0m[0m resource "cloudflare_record" "cname_dkim2" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2023-05-28T21:40:50.195624Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "protonmail2._domainkey.lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "fccded21c489eb0af1be2b60b8146d9c" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2023-05-28T21:40:50.195624Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "protonmail2._domainkey" [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = true [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "CNAME" [90m-> null[0m[0m
      [31m-[0m[0m value           = (sensitive value) [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.cname_dkim3[0m will be [1m[31mdestroyed[0m
  # (because cloudflare_record.cname_dkim3 is not in configuration)
[0m  [31m-[0m[0m resource "cloudflare_record" "cname_dkim3" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2023-05-28T21:40:49.707736Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "protonmail3._domainkey.lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "fbb831323bced8e857c178d8df4ebadb" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2023-05-28T21:40:49.707736Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "protonmail3._domainkey" [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = true [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "CNAME" [90m-> null[0m[0m
      [31m-[0m[0m value           = (sensitive value) [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.mx_proton_mail[0m will be [1m[31mdestroyed[0m
  # (because resource uses count or for_each)
[0m  [31m-[0m[0m resource "cloudflare_record" "mx_proton_mail" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m comment         = "First MX record for lilja.io zone." [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2023-05-28T21:40:49.939635Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "6a0c264f84eebecec606e8d26c26a424" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2023-05-28T21:40:49.939635Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m priority        = 10 [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = false [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "MX" [90m-> null[0m[0m
      [31m-[0m[0m value           = "mail.protonmail.ch" [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"][0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "mx_proton_mail" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m comment         = "MX records for lilja.io zone."
      [32m+[0m[0m content         = "mail.protonmail.ch"
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "lilja.io"
      [32m+[0m[0m priority        = 1
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = 1
      [32m+[0m[0m type            = "MX"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"][0m will be created
[0m  [32m+[0m[0m resource "cloudflare_record" "mx_proton_mail" {
      [32m+[0m[0m allow_overwrite = false
      [32m+[0m[0m comment         = "MX records for lilja.io zone."
      [32m+[0m[0m content         = "mailsec.protonmail.ch"
      [32m+[0m[0m created_on      = (known after apply)
      [32m+[0m[0m hostname        = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metadata        = (known after apply)
      [32m+[0m[0m modified_on     = (known after apply)
      [32m+[0m[0m name            = "lilja.io"
      [32m+[0m[0m priority        = 2
      [32m+[0m[0m proxiable       = (known after apply)
      [32m+[0m[0m proxied         = false
      [32m+[0m[0m ttl             = 1
      [32m+[0m[0m type            = "MX"
      [32m+[0m[0m value           = (known after apply)
      [32m+[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

[1m  # module.cloudflare_setup.cloudflare_record.mx_proton_mailsec[0m will be [1m[31mdestroyed[0m
  # (because cloudflare_record.mx_proton_mailsec is not in configuration)
[0m  [31m-[0m[0m resource "cloudflare_record" "mx_proton_mailsec" {
      [31m-[0m[0m allow_overwrite = false [90m-> null[0m[0m
      [31m-[0m[0m comment         = "Second MX record for lilja.io zone." [90m-> null[0m[0m
      [31m-[0m[0m created_on      = "2023-05-28T21:40:50.45664Z" [90m-> null[0m[0m
      [31m-[0m[0m hostname        = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m id              = "92ed20e9c1228ea46c74ea80d1505566" [90m-> null[0m[0m
      [31m-[0m[0m metadata        = {
          [31m-[0m[0m "auto_added"             = "false"
          [31m-[0m[0m "managed_by_apps"        = "false"
          [31m-[0m[0m "managed_by_argo_tunnel" = "false"
        } [90m-> null[0m[0m
      [31m-[0m[0m modified_on     = "2023-05-28T21:40:50.45664Z" [90m-> null[0m[0m
      [31m-[0m[0m name            = "lilja.io" [90m-> null[0m[0m
      [31m-[0m[0m priority        = 20 [90m-> null[0m[0m
      [31m-[0m[0m proxiable       = false [90m-> null[0m[0m
      [31m-[0m[0m proxied         = false [90m-> null[0m[0m
      [31m-[0m[0m tags            = [] [90m-> null[0m[0m
      [31m-[0m[0m ttl             = 1 [90m-> null[0m[0m
      [31m-[0m[0m type            = "MX" [90m-> null[0m[0m
      [31m-[0m[0m value           = "mailsec.protonmail.ch" [90m-> null[0m[0m
      [31m-[0m[0m zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" [90m-> null[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.mx_proton_spf1[0m will be updated in-place
[0m  [33m~[0m[0m resource "cloudflare_record" "mx_proton_spf1" {
      [32m+[0m[0m content         = "v=spf1 include:_spf.protonmail.ch mx ~all"
        id              = "63d176ec8068198506fb92d83af88bee"
        name            = "lilja.io"
        tags            = []
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1m  # module.cloudflare_setup.cloudflare_record.txt_dmarc[0m will be updated in-place
[0m  [33m~[0m[0m resource "cloudflare_record" "txt_dmarc" {
      [32m+[0m[0m content         = "v=DMARC1; p=quarantine"
        id              = "a8e709d83e8eb264c9efb249b6b7840a"
        name            = "_dmarc"
        tags            = []
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 5 to add, 2 to change, 5 to destroy.
[0m```

*Pusher: @jlilja, Action: `pull_request`, Workflow: `Plan Terraform code on PR`*